Sylvio84/ESP32MiniFramework/src/Managers/SystemManager.cpp
#ifdef ESP8266
    FSInfo fs_info;
    LittleFS.info(fs_info);
    size_t totalBytes = fs_info.totalBytes;
    size_t usedBytes = fs_info.usedBytes;
#endif

#ifdef ESP32
    size_t totalBytes = LittleFS.totalBytes();
    size_t usedBytes = LittleFS.usedBytes();
#endif

    String info = "";
    info += "Total bytes: " + String(totalBytes) + "\n";
    info += "Used bytes: " + String(usedBytes) + "\n";
    info += "Free bytes: " + String(totalBytes - usedBytes);

    return info;
}

// === CPU Control ===

void SystemManager::setCpuFrequency(int frequency)
{
#ifdef ESP32
    setCpuFrequencyMhz(frequency);
#endif
}

int SystemManager::getCpuFrequency()
{
    return ESP.getCpuFreqMHz();
}

float SystemManager::getCpuTemperature()
{
#ifdef ESP32
    return temperatureRead();
#else
    return 0.0;
#endif
}

// === System Control ===

void SystemManager::restartSystem()
{
    ESP.restart();
}

void SystemManager::performOtaUpdate()
{
    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
    if (wifiMgr) {
        wifiMgr->otaUpdate();
    } else {
        debug("WiFiManager not available for OTA update", 0);
    }
}

// === Power Management ===

void SystemManager::setPowerSaving(int value, bool save)
{
    auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
    auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));

    if (value < 0) {
        value = configMgr ? configMgr->getPreference("power_saving", 0) : 0;
    }
    if (value == 1) {
        value = 100;  // default value
    }

    powerSaving = value;

    if (powerSaving > 0) {
        debug("Power saving enabled: process every " + String(powerSaving) + "ms", 1);
        if (wifiMgr) {
            wifiMgr->setPowerSave(true);
        }
    } else {
        if (save) {
            debug("Power saving disabled", 1);
        } else {
            debug("Power saving suspended", 3);
        }
        if (wifiMgr) {
            wifiMgr->setPowerSave(false);
        }
    }

    if (save && configMgr) {
        configMgr->setPreference("power_saving", powerSaving);
    }
}

void SystemManager::clearPowerSavingResumeTimer()
{
    auto* timeMgr = static_cast<TimeManager*>(context->getManager("TimeManager"));
    if (timeMgr && powerSavingResumeTimer > 0) {
        timeMgr->clearTimeout(powerSavingResumeTimer);
        powerSavingResumeTimer = 0;
    }
}

// === Debug Level Management ===

void SystemManager::setDebugLevel(int level, bool save)
{
    debugLevel = level;
    debug("Debug level set to: " + String(debugLevel), 1);
    
    if (save) {
        auto* configMgr = static_cast<ConfigurationManager*>(context->getManager("ConfigurationManager"));
        if (configMgr) {
            configMgr->setPreference("debug_level", debugLevel);
        }
    }
}

// === Command Registration ===

void SystemManager::registerCommands()
{
    auto* cmdMgr = static_cast<CommandManager*>(context->getManager("CommandManager"));
    if (!cmdMgr) {
        debug("CommandManager not available for command registration", 1);
        return;
    }

    // Version command
    cmdMgr->registerCommand(Command("sys", "version", "Show framework version", CommandSource::Any, true, [this](const std::vector<String>& args) {
        return "Version: " + String(RELEASE_VERSION) + " (" + String(RELEASE_DATE) + ")";
    }));

    // Uptime command
    cmdMgr->registerCommand(Command("sys", "uptime", "Show system uptime", CommandSource::Any, true,
                                    [this](const std::vector<String>& args) { return "Uptime: " + String(millis() / 1000) + " seconds"; }));

    // Echo command
    cmdMgr->registerCommand(Command("sys", "echo", "Echo back the provided text", CommandSource::Any, true, [this](const std::vector<String>& args) {
        if (args.size() == 0) {
            return String("");
        }
        String result = "";
        for (size_t i = 0; i < args.size(); i++) {
            if (i > 0)
                result += " ";
            result += args[i];
        }
        return result;
    }));

    // Temperature command
    cmdMgr->registerCommand(Command("sys", "temp", "Show CPU temperature", CommandSource::Any, true, [this](const std::vector<String>& args) {
#ifdef ESP32
        float temp = getCpuTemperature();
        return "Temperature: " + String(temp) + "°C";
#else
            return "Temperature not supported on this device";
#endif
    }));

    // LED command - now delegates to InternalLedDevice
    cmdMgr->registerCommand(Command("sys", "led", "Control internal LED (on/off)", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
        auto* ledDev = getLedDevice();
        if (!ledDev) {
            return String("LED device not available");
        }

        if (args.size() > 0) {
            if (args[0] == "on") {
                ledDev->setState(true);
                return String("LED on");
            } else if (args[0] == "off") {
                ledDev->setState(false);
                return String("LED off");
            } else {
                return String("Invalid parameter. Usage: led on|off");
            }
        } else {
            return String("LED state: " + String(ledDev->isOn() ? "on" : "off"));
        }
    }));

    // CPU Frequency command
    cmdMgr->registerCommand(
        Command("sys", "freq", "Get/Set CPU frequency (80/160/240 MHz)", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
#ifdef ESP32
            if (args.size() > 0) {
                int freq = args[0].toInt();
                if (freq == 80 || freq == 160 || freq == 240) {
                    if (freq == 240 && ESP.getChipModel() == "ESP32C3") {
                        return String("240 MHz frequency not supported on ESP32-C3");
                    }
                    setCpuFrequency(freq);
                    return String("Frequency set to: " + String(freq) + " MHz");
                } else {
                    return String("Invalid frequency. Valid: 80, 160, 240 MHz");
                }
            } else {
                int freq = getCpuFrequency();
                return String("CPU Frequency: " + String(freq) + " MHz");
            }
#else
            return String("Frequency command not supported on this device");
#endif
        }));

    // System info command
    cmdMgr->registerCommand(Command("sys", "info", "Show comprehensive system information", CommandSource::Any, true,
                                    [this](const std::vector<String>& args) -> String { return getSystemInfo(); }));

    // Filesystem info command
    cmdMgr->registerCommand(Command("sys", "fs", "Show filesystem information", CommandSource::Any, true,
                                    [this](const std::vector<String>& args) -> String { return getFilesystemInfo(); }));

    // Restart command
    cmdMgr->registerCommand(Command("sys", "restart", "Restart the system", CommandSource::Any, true,  // Enable history for restart
                                    [this](const std::vector<String>& args) -> String {
                                        debug("Restarting system...", 1);
                                        delay(500);
                                        restartSystem();
                                        return String("Restarting...");
                                    }));

    // Reboot alias
    cmdMgr->registerAlias("reboot", "sys:restart");

    // OTA Update command
    cmdMgr->registerCommand(Command("sys", "ota", "Start OTA firmware update",
                                    CommandSource::Serial,  // Only from Serial for security
                                    true,                   // Enable history
                                    [this](const std::vector<String>& args) -> String {
                                        debug("Starting OTA update...", 1);
                                        performOtaUpdate();
                                        return String("OTA update started");
                                    }));

    // WiFi configuration commands
    cmdMgr->registerCommand(Command("wifi", "ssid", "Get/Set WiFi SSID", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
        auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
        if (!wifiMgr) {
            return String("WiFiManager not available");
        }

