Sylvio84/ESP32MiniFramework/src/Managers/SystemManager.cpp
        if (args.size() > 0) {
            // Set SSID
            wifiMgr->saveSSID(args[0], false);
            return String("WiFi SSID saved: " + args[0]);
        } else {
            // Get SSID
            String ssid = wifiMgr->retrieveSSID();
            if (ssid.isEmpty()) {
                return String("WiFi SSID: (not set)");
            } else {
                return String("WiFi SSID: " + ssid);
            }
        }
    }));

    cmdMgr->registerCommand(Command("wifi", "pass", "Get/Set WiFi password", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
        auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
        if (!wifiMgr) {
            return String("WiFiManager not available");
        }

        if (args.size() > 0) {
            // Set password
            wifiMgr->savePassword(args[0], false);
            return String("WiFi password saved");
        } else {
            // Get password (masked for security)
            String pass = wifiMgr->retrievePassword();
            if (pass.isEmpty()) {
                return String("WiFi password: (not set)");
            } else {
                return String("WiFi password: ****");
            }
        }
    }));

    cmdMgr->registerCommand(
        Command("wifi", "connect", "Connect to WiFi with saved credentials", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
            auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
            if (!wifiMgr) {
                return String("WiFiManager not available");
            }

            wifiMgr->autoConnect();
            return String("WiFi connection initiated");
        }));

    cmdMgr->registerCommand(
        Command("wifi", "status", "Show WiFi connection status", CommandSource::Any, true, [this](const std::vector<String>& args) -> String {
            auto* wifiMgr = static_cast<WiFiManager*>(context->getManager("WiFiManager"));
            if (!wifiMgr) {
                return String("WiFiManager not available");
            }

            String result = "WiFi Status:\n";
            result += "  Connected: " + String(wifiMgr->isConnected() ? "Yes" : "No") + "\n";
            result += "  SSID: " + wifiMgr->retrieveSSID() + "\n";
            result += "  Status: " + wifiMgr->getStatus() + "\n";
            if (wifiMgr->isConnected()) {
                result += "  IP: " + wifiMgr->retrieveIP();
            }
            return result;
        }));

    // Debug level command
    cmdMgr->registerCommand(Command("sys", "debug", "Get/Set debug level (0-3)", CommandSource::Any, true, 
        [this](const std::vector<String>& args) -> String {
            if (args.size() > 0) {
                int level = args[0].toInt();
                if (level >= 0 && level <= 9) {
                    setDebugLevel(level);
                    return String("Debug level set to: " + String(level));
                } else {
                    return String("Invalid debug level. Valid range: 0-9");
                }
            } else {
                return String("Debug level: " + String(debugLevel));
            }
        }));
    
    // Alias for backward compatibility (single digit command)
    cmdMgr->registerCommand(Command("", "debuglevel", "Set debug level (0-9)", CommandSource::Any, true,
        [this](const std::vector<String>& args) -> String {
            if (args.size() > 0) {
                int level = args[0].toInt();
                if (level >= 0 && level <= 9) {
                    setDebugLevel(level);
                    return String("Debug level set to: " + String(level));
                } else {
                    return String("Invalid debug level. Valid range: 0-9");
                }
            } else {
                return String("Debug level: " + String(debugLevel));
            }
        }));

    debug("System, WiFi, LED and Debug commands registered", 2);
}